README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<!-- 2016-04-21 Thu 23:24 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Problem 1: Multips of 3 and 5</a></li>
<li><a href="#sec-2">2. Problem 2: Even Fibonacci Numbers</a></li>
<li><a href="#sec-3">3. Problem 3: Largest Prime Factor</a></li>
<li><a href="#sec-4">4. Problem 4: Largest Palindrome Product</a></li>
<li><a href="#sec-5">5. Problem 5: Smallest Multiple</a></li>
<li><a href="#sec-6">6. Problem 6: Sum Square Difference</a></li>
</ul>
</div>
</div>
<p>
Project Euler Problems
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Problem 1: Multips of 3 and 5</h2>
<div class="outline-text-2" id="text-1">
<p>
If we list all the natural numbers below 10 that are multiples of 3 or 5, we 
get 3,5,6 and 9. The sum of these multiples is 23.
</p>

<p>
Find the sum of all the multiples of 3 or 5 below 1000.
</p>

<p>
<a href="./1.rb">./1.rb</a>
</p>

<div class="org-src-container">

<pre class="src src-ruby">multiples = (1..999).select{|i| i%3 == 0 || i%5 == 0}

p multiples.inject(0) {|sum, p| sum+p}
</pre>
</div>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Problem 2: Even Fibonacci Numbers</h2>
<div class="outline-text-2" id="text-2">
<p>
Each new term in the Fibonacci sequence is generated by adding the previous 
two terms. By starting with 1 and 2, the first 10 terms will be:
</p>

<pre class="example">
1,2,3,5,8,13,21,34,55,89, ...
</pre>

<p>
By considering the terms in the Fibonacci sequence whose values do not exceed 
four million, find the sum of the even-valued terms.
</p>

<p>
<a href="./2.rb">./2.rb</a>
</p>

<div class="org-src-container">

<pre class="src src-ruby">def fib(n)
  # creates a Fibonacci sequence up to last number &lt;= 4million
  # n = 7

  # [1,2]
  # [1,2,3]
  # [1,2,3,5]
  # [1,2,3,5,8]
  # [1,2,3,5,8,13]
  # [1,2,3,5,8,13,21]

  fib = [1,2]

  while fib.last &lt;= n
    fib.push (fib.last + fib[(fib.count-2)])
  end

  evens = fib.select{|i| i%2==0}

  p evens.inject(0){|sum,x| sum+x}

end

fib(4000000)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Problem 3: Largest Prime Factor</h2>
<div class="outline-text-2" id="text-3">
<p>
The prime factors of 13195 are 5, 7, 13 and 29.
</p>

<p>
What is the largest prime factor of the number 600851475143?
</p>

<p>
<a href="./3.rb">./3.rb</a>
</p>

<div class="org-src-container">

<pre class="src src-ruby">require 'prime'

def get_factors(n)

  prime_array = []
  p = 2

  if n &lt; 2
    return p
  end

  while p &lt; n
    if n%p == 0 &amp;&amp; Prime.prime?(p)
      prime_array.push(p)
      p prime_array
    end
    p +=1
  end

  return prime_array
end

p get_factors(600851475143)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Problem 4: Largest Palindrome Product</h2>
<div class="outline-text-2" id="text-4">
<p>
A palindromic number reads the same both ways. The largest palindrome made
from the product of two 2-digit numbers is 9009 = 91 × 99.
</p>

<p>
Find the largest palindrome made from the product of two 3-digit numbers.
</p>

<p>
<a href="./4.rb">./4.rb</a>
</p>

<div class="org-src-container">

<pre class="src src-ruby">def is_palindrome?(n)
  string = n.to_s
  mid = string.length/2

  a = string[0...mid]

  if string.length.even? 
    b = string[mid..-1]
  else
    b = string[mid+1..-1]
  end

  a == b.reverse
end

def get_factors_max(high,low)

  prods = {}
  pals = []

  high.downto(low).each do |i|

    a = i
    b = i

    until b == low-1
      if is_palindrome?(a*a)
        puts "PAL"
        prods["#{a}*(#{a})"] = a*a
        puts prods["#{a}*(#{a})"]
        pals.push a*a
      else
        if is_palindrome?(a*(b-1))
          puts "PAL"
          prods["#{a}*(#{b-1})"] = a*(b-1)
          puts prods["#{a}*(#{b-1})"]
          pals.push a*(b-1)
        end
      end
      b = b-1
    end

  end

  max = pals.max

  return pals
end

def largest_palindrome

  a = 999.downto(100).to_a
  a2 = a

  high = 999
  highest_possible = 999*999
  low = 100
  lowest_possible = 100*100

  get_factors_max(high,low)

end

p largest_palindrome
p largest_palindrome.max
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Problem 5: Smallest Multiple</h2>
<div class="outline-text-2" id="text-5">
<p>
2520 is the smallest number that can be divided by each of the numbers 
from 1 to 10 without any remainder. What is the smallest positive number that
is <i>evenly divisible</i> by all of the numbers from 1 to 20?
</p>

<p>
<a href="./5.rb">./5.rb</a>
</p>

<div class="org-src-container">

<pre class="src src-ruby">i = 20

while (i%2 != 0 ||
         i%3 != 0 ||
           i%4 != 0 ||
             i%5 != 0 ||
               i%6 != 0 ||
                 i%7 != 0 ||
                   i%8 != 0 ||
                     i%9 != 0 ||
                       i%10 != 0 ||
                         i%11 != 0 ||
                           i%12 != 0 ||
                             i%13 != 0 ||
                               i%14 != 0 ||
                                 i%15 != 0 ||
                                   i%16 != 0 ||
                                     i%17 != 0 ||
                                       i%18 != 0 ||
                                         i%19 != 0 ||
                                           i%20 != 0) 
    i = i+1
  end

p i
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Problem 6: Sum Square Difference</h2>
<div class="outline-text-2" id="text-6">
<p>
The sum of the squares of the first ten natural numbers is,
</p>

<pre class="example">
1^2 + 2^2 + ... + 10^2 = 385
</pre>

<p>
The square of the sum of the first ten natural numbers is,
</p>

<pre class="example">
(1 + 2 + ... + 10)^2 = 55^2 = 3025
</pre>

<p>
Hence the difference between the sum of the squares of the first ten natural 
numbers and the square of the sum is 3025 - 385 = 2640.
</p>

<p>
Find the difference between the sum of the squares of the first one hundred 
natural numbers and the square of the sum.
</p>

<p>
<a href="./6.rb">./6.rb</a>
</p>

<div class="org-src-container">

<pre class="src src-ruby">range = (1..100)
squares = range.map { |i| i*i }
sum_squares = squares.inject(0) { |sum, i| sum + i }

sum = range.inject(0) { |sum, i| sum + i }

p sum**2 - sum_squares
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
